import re

school_ip_map = {
    '國立宜蘭大學': ['140.111'],
    '國立臺灣大學': ['140.112'],
    '國立交通大學': ['140.113'],
    '國立清華大學': ['140.114'],
    '國立中央大學': ['140.115'],
    '國立成功大學': ['140.116'],
    '國立中山大學': ['140.117'],
    '國立臺灣科技大學': ['140.118'],
    '國立政治大學': ['140.119'],
    '國立中興大學': ['140.120'],
    '國立臺灣海洋大學': ['140.121'],
    '國立臺灣師範大學': ['140.122'],
    '國立中正大學': ['140.123'],
    '國立臺北科技大學': ['140.124'],
    '國立雲林科技大學': ['140.125'],
    '中華大學': ['140.126.3-21'],
    '國立新竹教育大學': ['140.126.22-23', '140.126.29-47'],
    '國立屏東科技大學': ['140.127.1-35'],
    '國立高雄師範大學': ['140.127.36-80'],
    '國立屏東教育大學': ['140.127.81-85'],
    '輔英科技大學': ['140.127.86-110'],
    '國立高雄應用科技大學': ['140.127.111-120', '140.127.149-150', '140.133.64-93'],
    '正修科技大學': ['140.127.121-140'],
    '空軍官校': ['140.127.149-160'],
    '文藻外語大學': ['140.127.164-170'],
    '國立台東大學': ['140.127.171-175'],
    '義守大學': ['140.127.176-191'],
    '國立高雄大學': ['140.127.198-234', '140.133.32-63'],
    '靜宜大學': ['140.128.1-40'],
    '南開科技大學': ['140.128.41-60'],
    '中國醫藥大學': ['140.128.61-70'],
    '國立勤益科技大學': ['140.128.71-95'],
    '東海大學': ['140.128.96-135'],
    '中山醫學大學': ['140.128.136-147'],
    '中臺科技大學': ['140.128.148-151'],
    '大同大學': ['140.129.1-50'],
    '國立陽明大學': ['140.129.51-80'],
    '台北海洋技術學院': ['140.129.81-85'],
    '國防大學': ['140.129.86-115 140.132'],
    '東南科技大學': ['140.129.116-145'],
    '國立虎尾科技大學': ['140.130.1-40'],
    '國立嘉義大學': ['140.130.41-50', '140.130.81-100'],
    '吳鳳科技大學': ['140.130.101-130'],
    '大同技術學院': ['140.130.131-150'],
    '環球科技大學': ['140.130.151-168'],
    '龍華科技大學': ['140.131.1-20'],
    '國立台灣藝術大學': ['140.131.21-30'],
    '華夏科技大學': ['140.131.31-40'],
    '銘傳大學': ['140.131.45-76'],
    '致理技術學院': ['140.131.77-84'],
    '國立臺北護理健康大學': ['140.131.85-95'],
    '國立臺南大學': ['140.133.1-15'],
    '逢甲大學': ['140.134'],
    '中原大學': ['140.135'],
    '天主教輔仁大學': [ '140.136'],
    '中國文化大學': ['140.137'],
    '元智大學': ['140.138'],
    '亞東技術學院': ['120.96.32-79'],
    '明新科技大學': ['120.105'],
    '國立彰化師範大學': ['120.107.144-215'],
    '建國科技大學': ['120.109.0-79'],
    '修平科技大學': ['120.109.160-191'],
    '靜宜大學': ['120.110', '140.128.1-40'],
    '國立虎尾科技大學': ['120.113.64-127'],
    '樹德科技大學': ['120.119'],
    '健行科技大學': ['120.124'],
    '銘傳大學': ['120.125.86'],
    '國立金門大學': ['120.125.96-111'],
    '國立臺北大學': ['120.126'],
    '國立東華大學': ['134.208'],
    '淡江大學': ['163.13'],
    '東吳大學': ['163.14'],
    '陸軍官校': ['163.15.1-23'],
    '高雄醫學大學': ['163.15.151-180'],
    '朝陽科技大學': ['163.17.1-63'],
    '國立臺中科技大學': ['163.17.131-145'],
    '國立高雄第一科技大學': ['163.18'],
    '耕莘健康管理專科學校': ['163.21.98'],
    '臺北市立大學': ['163.21.236'],
    '曁南大學': ['163.22'],
    '國立臺中教育大學': ['192.83.167'],
    '國立臺北大學': ['192.83.170-185', '192.192.35-36'],
    '國立臺中科技大學': ['192.83.172'],
    '國立彰化師範大學': ['192.83.173'],
    '大葉大學': ['192.83.174'],
    '國立臺北教育大學': ['192.83.179'],
    '國立體育大學': ['192.83.181'],
    '興國管理學院': ['192.83.182'],
    '國立宜蘭大學': ['192.83.183'],
    '高苑科技大學': ['192.83.190'],
    '實踐大學': ['192.83.193'],
    '國立高雄海洋科技大學': ['192.83.194-195'],
    '中央警察大學': ['192.192.1'],
    '嶺東科技大學': ['192.192.2'],
    '台南應用科技大學': ['192.192.3'],
    '崑山科技大學': ['192.192.30-32'],
    '南台科技大學': ['192.192.37-39'],
    '萬能科技大學': ['192.192.40-43'],
    '景文科技大學': ['192.192.44'],
    '嘉南藥理大學': ['192.192.45 '],
    '國立空中大學': ['192.192.48-55'],
    '健行科技大學': ['192.192.56-57'],
    '長庚大學': ['192.192.60-67'],
    '亞東技術學院': ['192.192.68-73'],
    '黎明技術學院': ['192.192.74-77'],
    '中國科技大學': ['192.192.78-85'],
    '僑光科技大學': ['192.192.125-129'],
    '明志科技大學': ['192.192.132-133'],
    '國立臺灣體育運動大學': ['192.192.139'],
    '德明財經科技大學': ['192.192.140-141'],
    '世新大學': ['192.192.148-159'],
    '中華科技大學': ['192.192.230'],
    '慈濟大學': ['203.64.76, 203.72.73-87'],
    '國立屏東商業技術學院': ['203.64.120', '203.64.127'],
    '臺北城市科技大學': ['203.64.215'],
    '國立高雄餐旅大學': ['203.68'],
    '臺北醫學大學': ['203.71.84-88'],
    '鳳山高中': ['210.70.89', '210.70.90'],
    '長榮大學': ['210.70.183'],
    '康寧大學': ['210.71.118'],
    '臺北基督學院': ['211.75.81.81'],
    '日本東京大學': ['133.11'],
    '中研院': ['140.109'],
}

class IpRule:
    """docstring for IpRule"""
    def __init__(self, school, rule):
        self.school = school
        self.rule = rule
        self.checker = [ b for b in rule.split('.') ]

    def match(self, ip_b, checker_b):
        if '-' in checker_b:
            [start, end] = checker_b.split('-')
            return int(start) <= int(ip_b) <= int(end)
        else:
            if not checker_b.isdigit():
                print("checker_b: %s" % checker_b)
                raise Exception("not checker_b.isdigit()")
            return checker_b == ip_b

    def if_match(self, ip_split):
        assert type(ip_split) == list
        for i in range(len(self.checker)):
            if not self.match(ip_split[i], self.checker[i]):
                return False
        return self.school

    def __str__(self):
        return '{0.school}:{0.rule}'.format(self)

def make_all_rules(school_ip_map):
    all_rules = []
    for k, v in school_ip_map.items():
        for rule in v:
            all_rules.append(IpRule(k, rule))
    return all_rules

def scan_matcher(ip, rules):
    """ 算了不優化 """
    ips = ip.split('.')
    for ip_ruler in rules:
        r = ip_ruler.if_match(ips)
        if r:
            return r
    return False

ALL_RULES = make_all_rules(school_ip_map)

if __name__ == '__main__':
    ip = '140.133.74.80'
    print("scan_matcher(ip, ALL_RULES): %s" % scan_matcher(ip, ALL_RULES))
